#include <iostream>
using namespace std;

/*Дана последовательность натуральных чисел, ограниченная вводом нуля. Вывести на экран произведение четных элементов этой последовательности. 
При этом ноль не считается членом последовательности.*/
/* run this program using the console pauser or add your own getch, system("pause") or input loop */

int main(int argc, char** argv) {
	cout << ""
	return 0;
}
